#+TITLE: Accumulators
#+DATE: \today
#+AUTHOR: Adair Antonio da Silva Neto

Three tipes of accumulators:

1. context preserving
2. result so far
3. worklist

* Context preserving

PROBLEM: Design a function that consumes a list of elements and produces the list consisting of only the 1st, 3rd, 5th and so on elements of its input.

#+begin_src clojure
  ;; (listof X) -> (listof X)
  ;; produce list consisting of only the 1st, 3rd, 5th... elements of lox
  ;; (defn skip1 [lox] empty) ;stub

  (ns test-problem
    (:require [clojure.test :refer :all]))

  (defn skip1 [lox0]
    ;; acc: Natural; 1-based position of (first lox) in lox0
    ;; (skip1 (list "a" "b" "c") 1)
    ;; (skip1 (list     "b" "c") 2)
    ;; (skip1 (list         "c") 3)
    (letfn [(skip1 [lox acc]
              (cond (empty? lox) '()
                    :else (if (odd? acc)
                              (cons (first lox)
                                    (skip1 (rest lox)
                                           (+ 1 acc)))
                              (skip1 (rest lox)
                                     (+ 1 acc)))))]
      (skip1 lox0 1)))

  ;; Use a context-preserving accumulator to keep track of the lost context (control variable)

  ;; Examples, Test and Debug
  (deftest skip1-tester
    (is (= (list "a" "c") (skip1 (list "a" "b" "c" "d"))))
    (is (= (list 1 3 5) (skip1 (list 1 2 3 4 5 6)))))

  (run-tests 'test-problem)  
#+end_src

#+RESULTS:
| #'test-problem/skip1                                  |
| #'test-problem/skip1-tester                           |
| {:test 1, :pass 2, :fail 0, :error 0, :type :summary} |

PROBLEM: Design a function that consumes a list of elements lox and a natural number n and produces the list formed by including the first element of lox, then skipping the next n elements, including an element, skipping the next n and so on.

#+begin_src clojure
  ;; (listof X), Natural -> (listof X)
  ;; produces list consisting of only the 1st, nth, 2nth... elements of lox
  ;; (defn skipn [lox] '()) ;stub

  (ns test-problem
    (:require [clojure.test :refer :all]))

  (defn skipn [lox0 n]
    ;; acc: Natural; the number of elements to skip before including the next one
    ;; (skipn (list "a" "b" "c" "d" "e") 0) ; include
    ;; (skipn (list     "b" "c" "d" "e") 2) ; don't include
    ;; (skipn (list         "c" "d" "e") 1) ; don't include
    ;; (skipn (list             "d" "e") 0) ; include
    ;; (skipn (list                 "e") 2) ; don't include
    (letfn [(skipn [lox acc]
              (cond (empty? lox) '()
                    :else (if (zero? acc)
                              (cons (first lox)
                                    (skipn (rest lox)
                                           n))
                              (skipn (rest lox)
                                     (- acc 1)))))]
      (skipn lox0 0)))

  ;; Examples, Test and Debug
  (deftest skipn-tester
    (is (= '() (skipn '() 0)))
    (is (= (list "a" "b" "c" "d" "e" "f") (skipn (list "a" "b" "c" "d" "e" "f") 0)))
    (is (= (list "a" "d") (skipn (list "a" "b" "c" "d" "e" "f") 2)))
    (is (= (list 1 5 9) (skipn (list 1 2 3 4 5 6 7 8 9) 3))))

  (run-tests 'test-problem)
#+end_src

#+RESULTS:
| #'test-problem/skipn                                  |
| #'test-problem/skipn-tester                           |
| {:test 2, :pass 6, :fail 0, :error 0, :type :summary} |

* Tail Recursion

PROBLEM:

(A) Consider the following function that consumes a list of numbers and produces the sum of all the numbers in the list. Use the stepper to analyze the behavior of this function as the list gets larger and larger.

(B) Use an accumulator to design a tail-recursive version of sum.

#+begin_src clojure

  ;; (listof Number) -> Number
  ;; produce sum of all elements of lon

  (ns test-problem
    (:require [clojure.test :refer :all]))

  (defn sum [lon]
    (cond (empty? lon) 0
          :else (+ (first lon)
                   (sum (rest lon)))))
  ;; adds data to the stack, which is expensive

  (defn sum [lon0]
    ;; acc: Number; the sum of the elements seen so far
    ;; (sum (list 2 4 5))
    ;; (sum (list 2 4 5)  0)
    ;; (sum (list   4 5)  2)
    ;; (sum (list     5)  6)
    ;; (sum (list      ) 11)
    (letfn [(sum [lon acc]
              (cond (empty? lon) acc
                    :else (sum (rest lon)
                               (+ acc (first lon)))))]
      (sum lon0 0)))

  (deftest sum-test
    (is (= 0 (sum '())))
    (is (= 11 (sum (list 2 4 5)))))

  (run-tests 'test-problem)

#+end_src

#+RESULTS:
| #'test-problem/sum                                    |
| #'test-problem/sum                                    |
| #'test-problem/sum-test                               |
| {:test 3, :pass 8, :fail 0, :error 0, :type :summary} |

`foldl` is tail recursive abstract fold function for lists.

Steps:

1. Template according to accumulator recipe
2. Delete part of template wrapping around recursive call
3. Computation that would have been around recursive call moves to be in accumulator argument position


